src/Catalogs/ПлощадкиЭксплуатации/ПлощадкиЭксплуатации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ПлощадкиЭксплуатации</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <attributes>
    <name>ЕдиницаКонтроля</name>
    <type>
      <types>CatalogRef.КонтрольныеПроцедуры</types>
      <types>CatalogRef.Публикации</types>
      <types>CatalogRef.Оборудование</types>
      <types>CatalogRef.ОбъектыКонтроля</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипЭлемента</name>
    <type>
      <types>EnumRef.ТипЭлементаПлощадки</types>
    </type>
  </attributes>
  <attributes>
    <name>Скрыть</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Площадка</name>
    <type>
      <types>CatalogRef.ПлощадкиЭксплуатации</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/InformationRegisters/НастройкиКонтрольПамяти/НастройкиКонтрольПамяти.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НастройкиКонтрольПамяти</name>
  <resources>
    <name>ПороговаяПамятьМБ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаОповещенияОЗависшихСеансахСкрыто</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>СрокХраненияДанных</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>АвтоматическиУдалятьЗаписиСеансов</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Расписание</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>Мониторинг</name>
    <comment>0 - Не мониторить, 1 - мониторить при превышении, 2 - мониторить всегда</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>КонтрольнаяПроцедура</name>
    <type>
      <types>CatalogRef.КонтрольныеПроцедуры</types>
      <types>CatalogRef.ВидыКонтрольныхПроцедур</types>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Catalogs/ПлощадкиЭксплуатации/Forms/ФормаГруппыКонтрольПотребленияПамяти/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    
    Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
        ЭтотОбъект.ПоложениеКоманднойПанели = ПоложениеКоманднойПанелиФормы.Нет;
        ЭтотОбъект.Элементы.Наименование.Видимость = Ложь;
        ЭтотОбъект.Элементы.ГруппаКоманднаяПанельНастройкиПоУмолчанию.Видимость = Истина;
        ЭтотОбъект.Элементы.ЗаписатьИЗАкрытьМоя.КнопкаПоУмолчанию = Истина;
    КонецЕсли;
    
    ЗаполнитьНастройкиПоУмолчанию();
    
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
    ЗаписатьНастройкиПоУмолчанию();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаписатьИЗакрытьМоя(Команда)
    
    ЗаписатьНастройкиПоУмолчанию();
    ЭтотОбъект.Закрыть();
    
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьМоя(Команда)
    ЗаписатьНастройкиПоУмолчанию();
КонецПроцедуры

&НаКлиенте
Процедура РасписаниеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
    
    Диалог = Новый ДиалогРасписанияРегламентногоЗадания(ЭтотОбъект.Расписание);
	Диалог.Показать(Новый ОписаниеОповещения("ОткрытьРасписаниеЗавершение", ЭтотОбъект));
    
    СтандартнаяОбработка = Ложь;
    
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьНастройкиПоУмолчанию()
    
    НастройкиПоУмолчанию = РегистрыСведений.НастройкиКонтрольПамяти.ПрочитатьНастройки(Справочники.ВидыКонтрольныхПроцедур.КонтрольПотребленияПамяти());
    
    Для Каждого ТекНастройка Из НастройкиПоУмолчанию Цикл
        
        Если ТекНастройка.Ключ = "ПороговаяПамятьМБ" Тогда
            
            НовСтрока = ПараметрыПоУмолчанию.Добавить();
            
            НовСтрока.Параметр = ТекНастройка.Ключ;
            НовСтрока.ПараметрПредставление = "Пороговое оперативной памяти, Мб";
            НовСтрока.ПараметрЗначение = ТекНастройка.Значение;
            
        ИначеЕсли ТекНастройка.Ключ = "АвтоматическиУдалятьЗаписиСеансов" Тогда
            
            НовСтрока = ПараметрыПоУмолчанию.Добавить();
            
            НовСтрока.Параметр = ТекНастройка.Ключ;
            НовСтрока.ПараметрПредставление = "Автоматически удалять записи";
            НовСтрока.ПараметрЗначение = ТекНастройка.Значение;
            
        ИначеЕсли ТекНастройка.Ключ = "СрокХраненияДанных" Тогда
            
            НовСтрока = ПараметрыПоУмолчанию.Добавить();
            
            НовСтрока.Параметр = ТекНастройка.Ключ;
            НовСтрока.ПараметрПредставление = "Хранить данные, часов";
            НовСтрока.ПараметрЗначение = ТекНастройка.Значение;
            
        ИначеЕсли ТекНастройка.Ключ = "Расписание" Тогда
            
            ЭтотОбъект.Расписание = ТекНастройка.Значение;
            Если ЭтотОбъект.Расписание = Неопределено Тогда
                ЭтотОбъект.Расписание = Новый РасписаниеРегламентногоЗадания;
            КонецЕсли;
                       
        КонецЕсли;
        
    КонецЦикла;
    
КонецПроцедуры

&НаСервере
Процедура ЗаписатьНастройкиПоУмолчанию()
    
    НастройкиПоУмолчанию = Новый Структура;
    
    Для Каждого ТекНастройка Из ПараметрыПоУмолчанию Цикл
        НастройкиПоУмолчанию.Вставить(ТекНастройка.Параметр, ТекНастройка.ПараметрЗначение);
    КонецЦикла;
    
    НастройкиПоУмолчанию.Вставить("Расписание", ЭтотОбъект.Расписание);
    
    РегистрыСведений.НастройкиКонтрольПамяти.ЗаписатьНастройки(Справочники.ВидыКонтрольныхПроцедур.КонтрольПотребленияПамяти(), НастройкиПоУмолчанию);
    
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьРасписаниеЗавершение(НовоеРасписание, Неопределен) Экспорт
    
    Если НовоеРасписание <> Неопределено Тогда
		ЭтотОбъект.Расписание = НовоеРасписание;
    КонецЕсли;
    
КонецПроцедуры

#КонецОбласти
